Repository: Gyarahaddo/ac-mobile-final
Catalog: lib/l10n/app_*.arb
Languages: fr, ko, zh

# copyright
source: @Algonquin College, CST2335 Final.
fr: @Collège Algonquin, CST2335 Finale.
ko: @알곤퀸 칼리지, CST2335 기말 프로젝트.
zh: @阿冈昆学院，CST2335 期末项目。

# btn2Confirm
source: Confirm
fr: Confirmer
ko: 확인
zh: 确认

# btn2Remove
source: Remove
fr: Retirer
ko: 삭제
zh: 删除

# btn2Discard
source: Discard
fr: Jeter
ko: 취소
zh: 取消

# btn2customer
source: Customer List
fr: Liste Des Clients
ko: 고객 목록
zh: 客户列表

# btn2airplane
source: Airplane List
fr: Liste Des Avions
ko: 항공기 목록
zh: 飞机列表

# btn2flight
source: Flight List
fr: Liste Des Vols
ko: 항공편 목록
zh: 航班列表

# btn2add
source: Add
fr: Ajouter
ko: 추가
zh: 添加

# btn2clear
source: Clear
fr: Claire
ko: 지우기
zh: 清除

# btn2reservation
source: Reservation List
fr: Liste De Réservation
ko: 예약 목록
zh: 预订列表

# text2noSelection
source: No Selection
fr: Aucune sélection
ko: 선택 없음
zh: 尚未选择

# text2update
source: Update Customer
fr: Mise à jour du client
ko: 고객 정보 수정
zh: 更新客户

# label2firstname
source: First Name
fr: Prénom
ko: 이름
zh: 名字

# label2lastname
source: Last Name
fr: Nom
ko: 성
zh: 姓氏

# label2address
source: Address
fr: Discours
ko: 주소
zh: 地址

# label2birthday
source: Birthday
fr: Anniversaire
ko: 생년월일
zh: 出生日期

# label2model
source: Model
fr: Modèle
ko: 모델
zh: 机型

# label2capacity
source: Capacity
fr: Capacité
ko: 탑승 인원
zh: 容量

# label2speed
source: Max Speed
fr: Vitesse maximale
ko: 최고 속도
zh: 最高速度

# label2range
source: Range
fr: Gamme
ko: 항속 거리
zh: 航程

# label2flightCode
source: Flight Code
fr: Code de vol
ko: 항공편 코드
zh: 航班编号

# label2fromCity
source: From City
fr: De la ville
ko: 출발 도시
zh: 出发城市

# label2toCity
source: To City
fr: D'où part la ville
ko: 도착 도시
zh: 目的城市

# label2departureTime
source: Departure Time
fr: Heure de départ
ko: 출발 시간
zh: 出发时间

# label2arrivalTime
source: Arrival Time
fr: Heure d'arrivée
ko: 도착 시간
zh: 到达时间

# label2assignedModel
source: Airplane Model
fr: Modèle d'avion
ko: 항공기 모델
zh: 飞机机型

# label2note
source: Note
fr: Remarque
ko: 비고
zh: 备注

# label2customerId
source: Customer
fr: Cliente
ko: 고객
zh: 客户

# label2flightDate
source: Flight Date
fr: Date du vol
ko: 항공 날짜
zh: 航班日期

# msg2noFirstname
source: Enter Firstname
fr: Entrez le prénom
ko: 이름을 입력하세요
zh: 请输入名字

# msg2noLastname
source: Enter Lastname
fr: Entrez le nom de famille
ko: 성을 입력하세요
zh: 请输入姓氏

# msg2noAddress
source: Enter Address
fr: Entrez l'adresse
ko: 주소를 입력하세요
zh: 请输入地址

# msg2noBirthday
source: Enter Birthday
fr: Entrez l'anniversaire
ko: 생년월일을 입력하세요
zh: 请输入出生日期

# msg2addCustomer
source: Successfully added new customer!
fr: Nouveau client ajouté avec succès!
ko: 새 고객이 성공적으로 추가되었습니다!
zh: 成功添加新客户！

# msg2customerHasReservation
source: Failed to remove: Customer has reservations.
fr: Échec de la suppression: le client a des réserves.
ko: 삭제 실패: 고객에게 예약이 있습니다.
zh: 删除失败：客户已有预订。

# msg2noUpdateCustomer
source: No update for customer.
fr: Aucune mise à jour pour le client.
ko: 고객 정보에 변경 사항이 없습니다.
zh: 无客户更新。

# msg2noModel
source: Enter Model
fr: Entrez le modèle
ko: 모델을 입력하세요
zh: 请输入机型

# msg2noCapacity
source: Enter Capacity
fr: Entrez la capacité
ko: 탑승 인원을 입력하세요
zh: 请输入容量

# msg2noSpeed
source: Enter Speed
fr: Entrez la vitesse
ko: 최고 속도를 입력하세요
zh: 请输入速度

# msg2noRange
source: Enter Range
fr: Entrer la plage
ko: 항속 거리를 입력하세요
zh: 请输入航程

# msg2addAirplane
source: Successfully added new airplane!
ko: 새 항공기가 성공적으로 추가되었습니다!
zh: 成功添加新飞机！

# msg2airplaneHasFlight
source: Failed to remove: Airplane is referred by Flights.
fr: Échec de la suppression: l'avion est référencé par Vols.
ko: 삭제 실패: 항공기가 항공편에 연결되어 있습니다.
zh: 删除失败：该飞机已被航班引用。

# msg2airplaneHasFlightNoUpdate
source: No update: Airplane is referred by Flights.
fr: Aucune mise à jour : l'avion est référencé par Vols.
ko: 업데이트 불가: 항공기가 항공편에 연결되어 있습니다.
zh: 无法更新：该飞机已被航班引用。

# msg2noUpdateAirplane
source: No update for airplane
fr: Aucune mise à jour pour l'avion
ko: 항공기 정보에 변경 사항이 없습니다.
zh: 无飞机更新。

# msg2noFlightCode
source: Entrez le code de vol
fr: Enter Flight Code
ko: 항공편 코드를 입력하세요
zh: 请输入航班编号

# msg2noFromCity
source: Enter From City
fr: Entrer de la ville
ko: 출발 도시를 입력하세요
zh: 请输入出发城市

# msg2noToCity
source: Enter To City
fr: Entrez dans la ville
ko: 도착 도시를 입력하세요
zh: 请输入目的城市

# msg2noDepartureTime
source: Enter Departure Time
fr: Entrez l'heure de départ
ko: 출발 시간을 입력하세요
zh: 请输入出发时间

# msg2noArrivalTime
source: Enter Arrival Time
fr: Entrez l'heure d'arrivée
ko: 도착 시간을 입력하세요
zh: 请输入到达时间

# msg2noAssignedModel
source: Enter Airplane Mode
fr: Entrer en mode avion
ko: 항공기 모델을 입력하세요
zh: 请输入飞机机型

# msg2noSuchModel
source: Failed to add: No such Airplane Model
fr: Échec de l'ajout: aucun modèle d'avion de ce type
ko: 추가 실패: 해당 항공기 모델이 없습니다
zh: 添加失败：无此飞机机型

# msg2addFlight
source: Successfully added new airplane!
fr: Nouvel avion ajouté avec succès!
ko: 새 항공편이 성공적으로 추가되었습니다!
zh: 成功添加新航班！

# msg2flightHasReservation
source: Failed to remove: Flight is referred by Reservations.
fr: Échec de la suppression: le vol est répertorié par les réservations.
ko: 삭제 실패: 항공편이 예약에 연결되어 있습니다.
zh: 删除失败：该航班已有预订引用。

# msg2noUpdateFlight
source: No update for flight
fr: Aucune mise à jour pour le vol
ko: 항공편 정보에 변경 사항이 없습니다.
zh: 无航班更新。

# msg2noNote
source: Enter Reservation Note
fr: Entrez la note de réservation
ko: 예약 비고를 입력하세요
zh: 请输入备注

# msg2noCustomer
source: Select a Customer
fr: Choisissez un client
ko: 고객을 선택하세요
zh: 请选择客户

# msg2noFlight
source: Select a Flight
fr: Choisissez un vol
ko: 항공편을 선택하세요
zh: 请选择航班

# msg2noFlightDate
source: Enter Flight Date
fr: Entrez la date du vol
ko: 항공 날짜를 입력하세요
zh: 请输入航班日期

# msg2addReservation
source: Successfully added new reservation!
fr: Nouvelle réservation avec succès ajoutée!
ko: 새 예약이 성공적으로 추가되었습니다!
zh: 成功添加新预订！

# msg2noUpdateReservation
source: No update for reservation
fr: Aucune mise à jour pour la réservation
ko: 예약 정보에 변경 사항이 없습니다.
zh: 无预订更新。
